Infineon/AURIX_code_examples/code_examples/iLLD_TC375_ADS_SCR_UART/Libraries/Infra/Sfr/TC37x/IfxCan_reg.h
/** \brief 930, Node 2 Timer Receive Timeout Register */
#define CAN1_N2_NT_RTR /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_NT_RTR*)0xF0218930u)
/** Alias (User Manual Name) for CAN1_N2_NT_RTR.
* To use register names with standard convension, please use CAN1_N2_NT_RTR.
*/
#define CAN1_NTRTR2 (CAN1_N2_NT_RTR)

/** \brief 940, Node 2 Port Control Register */
#define CAN1_N2_NPCR /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_NPCR*)0xF0218940u)
/** Alias (User Manual Name) for CAN1_N2_NPCR.
* To use register names with standard convension, please use CAN1_N2_NPCR.
*/
#define CAN1_NPCR2 (CAN1_N2_NPCR)

/** \brief A00, Core Release Register 2 */
#define CAN1_N2_CREL /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_CREL*)0xF0218A00u)
/** Alias (User Manual Name) for CAN1_N2_CREL.
* To use register names with standard convension, please use CAN1_N2_CREL.
*/
#define CAN1_CREL2 (CAN1_N2_CREL)

/** \brief A04, Endian Register 2 */
#define CAN1_N2_ENDN /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_ENDN*)0xF0218A04u)
/** Alias (User Manual Name) for CAN1_N2_ENDN.
* To use register names with standard convension, please use CAN1_N2_ENDN.
*/
#define CAN1_ENDN2 (CAN1_N2_ENDN)

/** \brief A0C, Data Bit Timing & Prescaler Register 2 */
#define CAN1_N2_DBTP /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_DBTP*)0xF0218A0Cu)
/** Alias (User Manual Name) for CAN1_N2_DBTP.
* To use register names with standard convension, please use CAN1_N2_DBTP.
*/
#define CAN1_DBTP2 (CAN1_N2_DBTP)

/** \brief A10, Test Register 2 */
#define CAN1_N2_TEST /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_TEST*)0xF0218A10u)
/** Alias (User Manual Name) for CAN1_N2_TEST.
* To use register names with standard convension, please use CAN1_N2_TEST.
*/
#define CAN1_TEST2 (CAN1_N2_TEST)

/** \brief A14, RAM Watchdog 2 */
#define CAN1_N2_RWD /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_RWD*)0xF0218A14u)
/** Alias (User Manual Name) for CAN1_N2_RWD.
* To use register names with standard convension, please use CAN1_N2_RWD.
*/
#define CAN1_RWD2 (CAN1_N2_RWD)

/** \brief A18, CC Control Register 2 */
#define CAN1_N2_CCCR /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_CCCR*)0xF0218A18u)
/** Alias (User Manual Name) for CAN1_N2_CCCR.
* To use register names with standard convension, please use CAN1_N2_CCCR.
*/
#define CAN1_CCCR2 (CAN1_N2_CCCR)

/** \brief A1C, Nominal Bit Timing & Prescaler Register 2 */
#define CAN1_N2_NBTP /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_NBTP*)0xF0218A1Cu)
/** Alias (User Manual Name) for CAN1_N2_NBTP.
* To use register names with standard convension, please use CAN1_N2_NBTP.
*/
#define CAN1_NBTP2 (CAN1_N2_NBTP)

/** \brief A20, Timestamp Counter Configuration 2 */
#define CAN1_N2_TSCC /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_TSCC*)0xF0218A20u)
/** Alias (User Manual Name) for CAN1_N2_TSCC.
* To use register names with standard convension, please use CAN1_N2_TSCC.
*/
#define CAN1_TSCC2 (CAN1_N2_TSCC)

/** \brief A24, Timestamp Counter Value 2 */
#define CAN1_N2_TSCV /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_TSCV*)0xF0218A24u)
/** Alias (User Manual Name) for CAN1_N2_TSCV.
* To use register names with standard convension, please use CAN1_N2_TSCV.
*/
#define CAN1_TSCV2 (CAN1_N2_TSCV)

/** \brief A28, Timeout Counter Configuration 2 */
#define CAN1_N2_TOCC /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_TOCC*)0xF0218A28u)
/** Alias (User Manual Name) for CAN1_N2_TOCC.
* To use register names with standard convension, please use CAN1_N2_TOCC.
*/
#define CAN1_TOCC2 (CAN1_N2_TOCC)

/** \brief A2C, Timeout Counter Value 2 */
#define CAN1_N2_TOCV /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_TOCV*)0xF0218A2Cu)
/** Alias (User Manual Name) for CAN1_N2_TOCV.
* To use register names with standard convension, please use CAN1_N2_TOCV.
*/
#define CAN1_TOCV2 (CAN1_N2_TOCV)

/** \brief A40, Error Counter Register 2 */
#define CAN1_N2_ECR /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_ECR*)0xF0218A40u)
/** Alias (User Manual Name) for CAN1_N2_ECR.
* To use register names with standard convension, please use CAN1_N2_ECR.
*/
#define CAN1_ECR2 (CAN1_N2_ECR)

/** \brief A44, Protocol Status Register 2 */
#define CAN1_N2_PSR /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_PSR*)0xF0218A44u)
/** Alias (User Manual Name) for CAN1_N2_PSR.
* To use register names with standard convension, please use CAN1_N2_PSR.
*/
#define CAN1_PSR2 (CAN1_N2_PSR)

/** \brief A48, Transmitter Delay Compensation Register 2 */
#define CAN1_N2_TDCR /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_TDCR*)0xF0218A48u)
/** Alias (User Manual Name) for CAN1_N2_TDCR.
* To use register names with standard convension, please use CAN1_N2_TDCR.
*/
#define CAN1_TDCR2 (CAN1_N2_TDCR)

/** \brief A50, Interrupt Register 2 */
#define CAN1_N2_IR /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_IR*)0xF0218A50u)
/** Alias (User Manual Name) for CAN1_N2_IR.
* To use register names with standard convension, please use CAN1_N2_IR.
*/
#define CAN1_IR2 (CAN1_N2_IR)

/** \brief A54, Interrupt Enable 2 */
#define CAN1_N2_IE /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_IE*)0xF0218A54u)
/** Alias (User Manual Name) for CAN1_N2_IE.
* To use register names with standard convension, please use CAN1_N2_IE.
*/
#define CAN1_IE2 (CAN1_N2_IE)

/** \brief A80, Global Filter Configuration 2 */
#define CAN1_N2_GFC /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_GFC*)0xF0218A80u)
/** Alias (User Manual Name) for CAN1_N2_GFC.
* To use register names with standard convension, please use CAN1_N2_GFC.
*/
#define CAN1_GFC2 (CAN1_N2_GFC)

/** \brief A84, Standard ID Filter Configuration 2 */
#define CAN1_N2_SIDFC /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_SIDFC*)0xF0218A84u)
/** Alias (User Manual Name) for CAN1_N2_SIDFC.
* To use register names with standard convension, please use CAN1_N2_SIDFC.
*/
#define CAN1_SIDFC2 (CAN1_N2_SIDFC)

/** \brief A88, Extended ID Filter Configuration 2 */
#define CAN1_N2_XIDFC /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_XIDFC*)0xF0218A88u)
/** Alias (User Manual Name) for CAN1_N2_XIDFC.
* To use register names with standard convension, please use CAN1_N2_XIDFC.
*/
#define CAN1_XIDFC2 (CAN1_N2_XIDFC)

/** \brief A90, Extended ID AND Mask 2 */
#define CAN1_N2_XIDAM /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_XIDAM*)0xF0218A90u)
/** Alias (User Manual Name) for CAN1_N2_XIDAM.
* To use register names with standard convension, please use CAN1_N2_XIDAM.
*/
#define CAN1_XIDAM2 (CAN1_N2_XIDAM)

